In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('https://www.dropbox.com/s/vnkhtwm4m67khqb/demographic_data.csv?dl=1')

In [6]:
df.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [7]:
df.tail()

,Country Name,Country Code,Birth rate,Internet users,Income Group
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [8]:
df.sample(5)

    Country Name Country Code  Birth rate  Internet users         Income Group
124     Malaysia          MYS      16.805         66.9700  Upper middle income
84       Iceland          ISL      13.400         96.5468          High income
43        Cyprus          CYP      11.436         65.4548          High income
129    Nicaragua          NIC      20.788         15.5000  Lower middle income
118   Montenegro          MNE      11.616         60.3100  Upper middle income

In [12]:
df['Country Name']

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: Country Name, Length: 195, dtype: object

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country Name    195 non-null    object
 1   Country Code    195 non-null    object
 2   Birth rate      195 non-null    float64
 3   Internet users  195 non-null    float64
 4   Income Group    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [14]:
df.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country Name    195 non-null    object
 1   Country Code    195 non-null    object
 2   Birth rate      195 non-null    float64
 3   Internet users  195 non-null    float64
 4   Income Group    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [13]:
df.describe()

       Birth rate  Internet users
count  195.000000      195.000000
mean    21.469928       42.076471
std     10.605467       29.030788
min      7.900000        0.900000
25%     12.120500       14.520000
50%     19.680000       41.000000
75%     29.759500       66.225000
max     49.661000       96.546800

In [16]:
df.describe(include='all')

       Country Name Country Code  Birth rate  Internet users Income Group
count           195          195  195.000000      195.000000          195
unique          195          195         NaN             NaN            4
top           Aruba          ABW         NaN             NaN  High income
freq              1            1         NaN             NaN           67
mean            NaN          NaN   21.469928       42.076471          NaN
std             NaN          NaN   10.605467       29.030788          NaN
min             NaN          NaN    7.900000        0.900000          NaN
25%             NaN          NaN   12.120500       14.520000          NaN
50%             NaN          NaN   19.680000       41.000000          NaN
75%             NaN          NaN   29.759500       66.225000          NaN
max             NaN          NaN   49.661000       96.546800          NaN

In [17]:
df.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [18]:
df.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [25]:
df['Internet users'].mean()

np.float64(42.07647089194872)

In [27]:
df['Birth rate'].min()

np.float64(7.9)

In [29]:
max_users = df['Internet users'].max()
df[df['Internet users'] == max_users]

   Country Name Country Code  Birth rate  Internet users Income Group
84      Iceland          ISL        13.4         96.5468  High income

In [32]:
df[df['Income Group'] == 'Low income']['Internet users'].mean()

np.float64(5.988333333333333)

In [15]:
df.iloc[0]

Country Name            Aruba
Country Code              ABW
Birth rate             10.244
Internet users           78.9
Income Group      High income
Name: 0, dtype: object

In [19]:
df.dropna()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [21]:
df.fillna(0)

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [25]:
grouped_df = df.groupby('Internet users').sum()
grouped_df.head()

,Country Name,Country Code,Birth rate,Income Group
Internet users,,,,
0.9,Eritrea,ERI,34.800,Low income
1.1,Timor-Leste,TLS,35.755,Lower middle income
1.3,Burundi,BDI,44.151,Low income
1.5,Somalia,SOM,43.891,Low income
1.6,GuineaMyanmar,GINMMR,55.456,Low incomeLower middle income

In [26]:
df.to_csv('processed_data.csv', index=False)

In [29]:
df.loc[0:5, ['Country Name', 'Income Group']]

           Country Name         Income Group
0                 Aruba          High income
1           Afghanistan           Low income
2                Angola  Upper middle income
3               Albania  Upper middle income
4  United Arab Emirates          High income
5             Argentina          High income

In [34]:
df.iloc[0:5, [0, 4]]

           Country Name         Income Group
0                 Aruba          High income
1           Afghanistan           Low income
2                Angola  Upper middle income
3               Albania  Upper middle income
4  United Arab Emirates          High income

In [36]:
df['new_column'] = df['Internet users'].apply(lambda x: x * 2)
df.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group,new_column
0,Aruba,ABW,10.244,78.9,High income,157.8
1,Afghanistan,AFG,35.253,5.9,Low income,11.8
2,Angola,AGO,45.985,19.1,Upper middle income,38.2
3,Albania,ALB,12.877,57.2,Upper middle income,114.4
4,United Arab Emirates,ARE,11.044,88.0,High income,176.0

In [38]:
df['new_column'] = df.apply(lambda row: row['Internet users'] + row['Birth rate'], axis=1)
df.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group,new_column
0,Aruba,ABW,10.244,78.9,High income,89.144
1,Afghanistan,AFG,35.253,5.9,Low income,41.153
2,Angola,AGO,45.985,19.1,Upper middle income,65.085
3,Albania,ALB,12.877,57.2,Upper middle income,70.077
4,United Arab Emirates,ARE,11.044,88.0,High income,99.044

In [42]:
df.drop(columns=['new_column'], inplace=True)

In [44]:
df.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [47]:
df.pivot_table(values='Birth rate', index='Country Name', aggfunc='sum')

                       Birth rate
Country Name
Afghanistan                35.253
Albania                    12.877
Algeria                    24.738
Angola                     45.985
Antigua and Barbuda        16.447
...                           ...
Virgin Islands (U.S.)      10.700
West Bank and Gaza         30.394
Yemen, Rep.                32.947
Zambia                     40.471
Zimbabwe                   35.715

[195 rows x 1 columns]

In [52]:
pd.crosstab(df['Country Name'], df['Income Group'])

Income Group,High income,Low income,Lower middle income,Upper middle income
Country Name,,,,
Afghanistan,0,1,0,0
Albania,0,0,0,1
Algeria,0,0,0,1
Angola,0,0,0,1
Antigua and Barbuda,1,0,0,0
...,...,...,...,...
Virgin Islands (U.S.),1,0,0,0
West Bank and Gaza,0,0,1,0
"Yemen, Rep.",0,0,1,0
Zambia,0,0,1,0
Zimbabwe,0,1,0,0

In [ ]:
df['Income Group'].fillna('Upper middle income', inplace=True)